#include <stdio.h>
#include <string.h>

void HuangXiaoYun()
{
    printf("黄霄云，1998年12月22日出生于贵州省黔南布依族苗族自治州罗甸县龙坪镇，中国内地流行乐女歌手、影视演员，毕业于中央音乐学院\n2011年，黄霄云与家人参加CCTV-3家庭才艺展示节目《欢乐一家亲》。2013年，获得贵州省第六届“贵青杯”歌唱比赛金奖。2014年，获得“中国音乐学院附中好声音歌手大赛”一等奖。2015年，黄霄云参加浙江卫视歌唱选秀节目《中国好声音第四季》，获得汪峰组四强、全国16强。2016年，参演青春校园网络剧《薛定谔的猫》/2017年12月，发行首支个人单曲《征战》。2018年5月，退出个人原创单曲《打开》；同年，参加多彩贵州歌唱大赛，获得黔南赛区通俗唱法组二等奖、美声唱法组一等奖、贵州省美声歌唱组优秀奖。2019年，为都市悬疑剧《七日生》演唱的插曲《来自火焰谷的情书》发布；同年，获得百度第一届“音你成名”音乐比赛季军。2020年2月，以奇袭歌手身份加盟湖南卫视音乐竞技节目《歌手·当打之年》，并奇袭成功；同年，推出首张个人音乐专辑《黄霄云的Neverland》。2021年，推出个人单曲《星辰大海》，7月30日，以导师助教身份登台《中国好声音2021》。2022年7月29日，以“青春导师”的身份加盟《2022中国好声音》。2023年1月21日，黄霄云首登《中央广播电视总台春节联欢晚会》。4月10日，为电视剧《长月烬明》插曲《要不然我们就这样一万年》上线。同年8月19日和20日，黄霄云在广州举办首次个人演唱会；11月3日，为电视剧《以爱为营》演唱的歌曲《冥冥》发布。12月31日，参加《启航2024——中央广播电视总台跨年晚会》，与马佳、石凯、李允儿演唱歌曲《有你》。2024年1月27日，参加《航天之夜》。\n");
}

void YangChaoYue()
{
    printf("杨超越，1998年7月31日出生于江苏省盐城市大丰区，中国内地流行乐女歌手、影视演员。\n2017年，加入女子演唱组合CH2，从而正式出道。2018年，参加腾讯视频女团青春成长节目《创造101》，最终获得第3名，并加入限定组合火箭少女；同年，相继推出个人单曲跟着我一起《冲鸭冲鸭》《招财进宝》；12月15日，获得“影响中国”年度演艺人物奖，2019年3月，杨超越被评选为LikeTCCAsia亚太区最美100张面孔第3位、中国区最美100张面孔第1位；6月11日，获得上海国际电影电视节暨互联网影视精品盛典网络综艺年度个人表现奖；8月13日，主演的青春运动励志剧《极限17:羽你同行》播出。\n2020年，主演的古装玄幻剧《将夜2》、仙侠玄幻甜宠剧《且听凤鸣》、都市恋爱轻喜剧《仲夏满天心》相继播出，并演唱了《仲夏满天心》插曲《小红象》；6月23日，火箭少女101组合到期解散；9月9日，公益合作曲《一块做好事》上线。同年，相继主演了都市职场剧《理想之城》、古装武侠剧《说英雄谁是英雄》。2021年，主演古装仙侠剧《重紫》/2022年，相继主演古装神话轻喜剧《七时吉祥》，家庭题材情景喜剧《家有姐妹》。\n");
}

void XueZhiQian()
{
    printf("薛之谦(Joker Xue)，1983年7月17日出生于上海，华语流行乐男歌手、影视演员、音乐制作人，毕业于格里昂酒店管理学院。\n2005年，因参加选秀节目《我型我秀》而正式出道。2006年发行首张同名专辑《薛之谦》，随后凭借歌曲《认真的雪》获得广泛关注。2007年，凭借专辑《你过得好吗》获得MusicRadio中国TOP排行榜内地年度最受欢迎男歌手奖。2008年，发行专辑《深深爱过你》；同年在上海举行个人首场演唱会“谦年传说”。2013年，专辑《几个薛之谦》获得MusicRadio中国TOP排行榜内地推奖唱片。2014年，凭借专辑《意外》获得第21届东方风云榜颁奖最佳唱作人；同年他还获得音悦V榜年度盛典年度创作歌手奖。2015年6月，薛之谦首度担当制作人并发行原创EP《绅士》；同年，他还主演都市励志剧《妈妈像花儿一样》。2016年，凭借EP《绅士》《一半》获得第16届全球华语歌曲排行榜最受欢迎男歌手、五大最受欢迎男歌手奖、上海地区杰出歌手奖及最受欢迎创作歌手奖，而歌曲《初学者》则获得年度二十大金曲奖。2017年4月，开启“我好像在哪见过你”全国巡回演唱会；同年，薛之谦获得第7届全球流行音乐年度盛典年度最佳男歌手及MusicRadio榜中国TOP排行榜内地最佳男歌手。\n2018年7月，薛之谦“摩天大楼”世界巡回演唱会于北京站启程，整个巡演横跨4大洲，8个国家，21个城市，累计上演场次23场。2019年2月14日，薛之谦在马来西亚举办巡回演唱会；同年12月27日，发行第十张个人专辑《尘》。2020年1月11日薛之谦获得年度原创音乐人。2020年12月31日，发行第11张个人专辑《天外来物》。2022年，发行个人音乐专辑《无数》。\n2023年4月20日，发行单曲《Nothing》。7月1日至7月2日在西安奥体中心体育场举行“天外来物”巡回演唱会。7月14日，参加的励志专业音乐评论节目《中国好声音2023》播出；11月3日，参加的综艺《火星情报局第六季》播出；12月8日，发布新单曲《情书》。\n");
}

void Michael_Jackson()
{
    printf("Michael Jackson(迈克尔·杰克逊)，1958年8月29日出生于美国印第安纳州，美国流行乐男演唱家、词曲创作人、音乐家、舞蹈家、慈善家、人道主义者、和平主义者、慈善机构创办人。\n杰克逊是家族的第七个孩子，他在1964年作为杰克逊五人组的成员和他的兄弟一起在职业音乐舞台上初次登台，1968年，乐队与当地的一家唱片公司合作出版了第一张唱片《Big Boy》。\n1971年12月，杰克逊发行了个人首支单曲《Got To Be There》，标志着其个人独唱生涯的开始。1982年12月，杰克逊音乐生涯最畅销的专辑《颤栗》发行。1987年9月，杰克逊展开个人首次全球巡演。通过舞台和视频的表演，杰克逊普及了机械舞、太空步等舞蹈技术。杰克逊一生中获得了13座格莱美奖和26座全美音乐奖，拥有“最成功的艺术家”吉尼斯世界纪录称号。在他的个人独唱生涯中，他拥有13支美国冠军单曲。\n1985年，为赈济非洲饥民，创作并演唱了歌曲《天下一家》，其收益全部用于援助非洲饥民。\n2010年1月，杰克逊被授予格莱美终身成就奖。\n");
}

void BaiLu()
{
    printf("白鹿，本名白梦妍，1994年9月23日出生于江苏省常州市，中国内地女演员、模特。\n2016年，凭借出演陆虎单曲《留言》MV中的女主角而进入演艺圈。2017年，白鹿在古装剧《凤囚凰》中一人分饰两角，并演唱该剧主题曲《凤囚凰》；12月，凭借爱情轻喜剧《大王不容易》获得腾讯视频星光大赏年度潜力电视剧女演员奖。2018年，凭借《凤囚凰》获得爱奇艺尖叫之夜年度戏剧潜力艺人。2019年，主演热血青春剧《烈火军校》。2020年，参加中央广播电视总台2020《江山如画国庆音乐会》，与梦然、张继科合唱歌曲《少年》。2021年，主演古装轻喜剧《玉楼春》；同年，主演的古装剧《周生如故》和情感剧《一生一世》相继在爱奇艺播出。2022年，主演的都市生活剧《警察荣誉》在中央电视台电视剧频道播出。2023年1月14日，参加《2022爱奇艺尖叫之夜》，获得“年度会员影响力女演员”奖项；11月25日，凭借《宁安如梦》等多部作品获得爱奇艺尖叫之夜尖叫女演员奖项。\n");
}

void Marilyn_Monroe()
{
    printf("玛丽莲·梦露（Marilyn Monroe，1926年6月1日—1962年8月5日），本名“诺玛·简·莫泰森”，出生在美国加利福尼亚州洛杉矶市，美国女演员、制片人。\n1948年，出演了电影处女作《斯库达，嚯！斯库达，嗨！》。1950年，出演了剧情片《彗星美人》，展示了她的光采。1952年，她开始担任女主角。次年推出的两部影片《绅士爱美人》《如何嫁给一个百万富翁》，确认了她世界上最大牌的电影明星的地位。1955年6月3日，主演的爱情喜剧片《七年之痒》上映，凭借该片获得第9届英国电影和电视艺术学院奖电影奖-最佳外国女演员提名。之后，她离开好莱坞，来到纽约师从著名的表演老师学习表演。1957年6月13日，主演的爱情喜剧片《游龙戏凤》首映，由此提名第11届英国电影和电视艺术学院奖电影奖-最佳外国女演员。这期间，梦露成立了自己的制作公司。1959年3月29日，她制作的最成功的影片《热情似火》上映，迎来她演艺生涯的顶峰，并凭借这部出色的电影获得了她演艺生涯中的最高肯定：金球奖最佳喜剧女主角。1961年2月1日，主演的西部爱情电影《不合时宜的人》首映，这是她最后一部完整的作品。次年，主演的喜剧短片《濒于崩溃》上映，这是她的最后一部电影。1962年8月5日，玛丽莲·梦露在洛杉矶布莱登木寓所的卧室内被发现去世，终年36岁。1999年，被美国电影学会评选为“百年来最伟大的女演员”第6名。\n");
}

int main()
{
    char arr[] = "";
    while(1)
    {
        printf("想查看谁（按p退出）：");
        scanf("%s",arr);
        if(strcmp(arr,"p") == 0)
        {
            printf("退出\n");
            break;
        }
        else if(strcmp(arr,"黄霄云") == 0 || strcmp(arr,"面包") == 0 || strcmp(arr,"阿鬼") == 0 || strcmp(arr,"huangxiaoyun") == 0)
        {
            HuangXiaoYun();
        }
        else if(strcmp(arr,"杨超越") == 0)
        {
            YangChaoYue();
        }
        else if(strcmp(arr,"薛之谦") == 0)
        {
            XueZhiQian();
        }
        else if(strcmp(arr,"迈克尔杰克逊") == 0 || strcmp(arr,"MJ") == 0 || strcmp(arr,"迈克尔·杰克逊") == 0 || strcmp(arr,"Michael_Jackson") == 0)
        {
            Michael_Jackson();
        }
        else if(strcmp(arr,"白鹿") == 0 || strcmp(arr,"白梦妍") == 0)
        {
            BaiLu();
        }
        else if(strcmp(arr,"玛丽莲梦露") == 0 || strcmp(arr,"玛丽莲·梦露") == 0 || strcmp(arr,"梦露") == 0 || strcmp(arr,"Marylin_Monroe") == 0)
        {
            Marilyn_Monroe();
        }
        else
        {
            printf("暂时没有录入这个人,请重新输入\n");
            while(getchar() != '\n');
            continue;
        }
        while(getchar() != '\n');
    }
    return 0;
}